<h1>Part 02 : Pandas :)</h1>

In [2]:
import pandas as pd     # A software library for the Python programming language for data manipulation and analysis.
import numpy as np     # A library for the Python programming language, adding support for large, multi-dimensional arrays and matrices, along with a large collection of high-level mathematical functions to operate on these arrays.
import os     # This module provides a portable way of using operating system dependent functionality.

<h2>DataFrame</h2>

In [3]:
# Give a Dictionary to a Dataframe
car = {
    'id_car' : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'name_car' : ['Bugatti', 'Koenigsegg', 'Hennessey', 'Lamborghini', 'Ferrari', 'Porsche', 'Ford', 'Chevrolet', 'Tesla', 'BMW'],
    'max_speed' : [490, 531, 500, 349, 349, 340, 348, 341, 322, 306]
}
lst = [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000]

df = pd.DataFrame(car, index = lst)     # Create DataFrame from dictionary
df     # Show the output as a table (note: Its type is dataframe)

      id_car     name_car  max_speed
100        1      Bugatti        490
200        2   Koenigsegg        531
300        3    Hennessey        500
400        4  Lamborghini        349
500        5      Ferrari        349
600        6      Porsche        340
700        7         Ford        348
800        8    Chevrolet        341
900        9        Tesla        322
1000      10          BMW        306

In [4]:
df [1 : 4]     # Split dataframe

     id_car     name_car  max_speed
200       2   Koenigsegg        531
300       3    Hennessey        500
400       4  Lamborghini        349

In [5]:
df.head()     # Show 5 first rows

     id_car     name_car  max_speed
100       1      Bugatti        490
200       2   Koenigsegg        531
300       3    Hennessey        500
400       4  Lamborghini        349
500       5      Ferrari        349

In [6]:
df.tail()     # Show 5 last rows

      id_car   name_car  max_speed
600        6    Porsche        340
700        7       Ford        348
800        8  Chevrolet        341
900        9      Tesla        322
1000      10        BMW        306

In [7]:
df.columns     # Show title of columns

Index(['id_car', 'name_car', 'max_speed'], dtype='object')

In [8]:
df['name_car']    # Show values of a columns

100         Bugatti
200      Koenigsegg
300       Hennessey
400     Lamborghini
500         Ferrari
600         Porsche
700            Ford
800       Chevrolet
900           Tesla
1000            BMW
Name: name_car, dtype: object

In [9]:
df['max_speed'].max()

531

In [10]:
df['max_speed'].min()

306

In [11]:
df['max_speed'].sum()

3876

In [12]:
df['max_speed'].mean()     # Average of a column

387.6

In [13]:
df.describe()     # Statistical description of numerical data

         id_car   max_speed
count  10.00000   10.000000
mean    5.50000  387.600000
std     3.02765   84.083556
min     1.00000  306.000000
25%     3.25000  340.250000
50%     5.50000  348.500000
75%     7.75000  454.750000
max    10.00000  531.000000

In [14]:
# Give a List to a Dataframe
lst_id_car = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
lst_name_car = ['Bugatti', 'Koenigsegg', 'Hennessey', 'Lamborghini', 'Ferrari', 'Porsche', 'Ford', 'Chevrolet', 'Tesla', 'BMW']
lst_max_speed = [490, 531, 500, 349, 349, 340, 348, 341, 322, 306]

df = pd.DataFrame(zip(lst_id_car, lst_name_car, lst_max_speed), columns = ['id_car', 'name_car', 'max_speed'])     # Create DataFrame from List using zip()
df

   id_car     name_car  max_speed
0       1      Bugatti        490
1       2   Koenigsegg        531
2       3    Hennessey        500
3       4  Lamborghini        349
4       5      Ferrari        349
5       6      Porsche        340
6       7         Ford        348
7       8    Chevrolet        341
8       9        Tesla        322
9      10          BMW        306

In [15]:
# where is your code
os.getcwd()     # Show Current Working Directory (CWD)

'F:\\2_DataScience\\DataScience_mynb\\DataScience_Py\\02_Pandas'

In [16]:
os.listdir()     # Show list of directories and files in your CWD

['.ipynb_checkpoints', 'DS_02_Pandas.ipynb', 'practice_titanic.ipynb']

In [17]:
# Create a Dataframe by random numbers, personal indexes and columns titles
pd.DataFrame(np.random.rand(10, 3) * 100, index = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], columns = ['A', 'B', 'C'])

            A          B          C
1   61.970276  19.458191  32.011797
2   76.193654  18.143149  90.154231
3   65.738321  48.762735  95.953918
4   23.072590  28.599111  11.556708
5    1.417400  48.450558  72.739245
6   94.965235  81.572082  47.548739
7   99.845243  80.192073  48.694674
8   98.358483  84.888245  66.581743
9   37.834783   6.421405  32.547353
10  73.738556  90.449318  29.719060

<h2>Read Excel file</h2>

In [18]:
tita = pd.read_excel('titanic3.xlsx')     # read_excel(Path of Excel file) ==> If Excel file is in CWD, its name is enough.
tita

FileNotFoundError: [Errno 2] No such file or directory: 'titanic3.xlsx'

<h2>Read CSV file</h2>

In [ ]:
iris = pd.read_csv('iris.csv')
iris

In [ ]:
iris.head()     # Show 5 first rows

In [ ]:
iris.tail()     # Show 5 last rows

In [ ]:
iris.head(10)     # head(n) ==> Show n first rows (n is optional)

In [ ]:
iris.tail(10)     # tail(n) ==> Show n last rows (n is optional)

In [ ]:
iris.shape     # Show Dimensions of dataframe(same csv/excel file)

In [ ]:
tita.info()     # Show information of Dataframe (column title, count of non null values in every column, data type of per column)

In [ ]:
tita.survived     # equal with 'tita['survived']'

In [ ]:
arr_np = tita['survived'].values     # return Array of values (Numpy)
arr_np

In [ ]:
tita['survived'].sum()     # Sum of values of 'survived' column

In [ ]:
# or:
tita['survived'].values.sum()

In [ ]:
tita.survived.value_counts()     # Count of unique values in column

In [ ]:
tita.count()     # Count of non values in each column

In [ ]:
tita[['pclass', 'survived', 'age']]     # Show multi column values

In [ ]:
tita[['pclass', 'survived', 'age']].sum()     # Sum of multi column,separately

In [ ]:
tita[['pclass', 'survived', 'age']].mean()     # mean of multi column,separately

<h2>Note: </h2>
<h3>You should understand dataset related to business</h3>
<h3>You should understand process of work</h3>

In [ ]:
# Slice of dataset - method 1
tita.values[0 : 10, 0 : 4]     # slice as a array(numpy)

In [ ]:
tita[['pclass', 'survived', 'name']][10 : 21]

In [ ]:
# Slice of dataset - method 2
tita.iloc[0 : 5, 0 : 3]     # you can give a numerical value to specify the columns

In [ ]:
tita.iloc[[10, 1, 4], [5, 1, 3, 2]]     # you can specify rows or columns in no order

In [ ]:
tita.loc[0 : 5, ['pclass', 'survived']]     # you can give string value to specify the columns

In [ ]:
tita.loc[[10, 1, 4], ['age', 'name', 'survived']]      # you can specify rows or columns in no order

In [ ]:
tita['pclass'].unique()     # unique values in a column

In [ ]:
tita['pclass'].nunique()     # count of unique values in a column

In [ ]:
tita['pclass'].unique().shape     # count of unique values in a column

<h2>Conditions</h2>

In [ ]:
iris['sepal_length'] >= 5     # output is boolean for all rows

In [ ]:
(iris['sepal_length'] >= 5).value_counts()     # count of True values and False values for all rows

In [ ]:
iris[iris['sepal_length'] >= 5]     # Rows for which the condition is fulfilled

In [ ]:
# Several conditions
iris[(iris['sepal_length'] > 6) & (iris['sepal_length'] < 7.5) & (iris['class'] == 'Iris-virginica')]

In [ ]:
iris[(iris['sepal_length'] > 6) & (iris['sepal_length'] < 7.5) & (iris['class'] == 'Iris-virginica')].shape

In [ ]:
iris['class'].unique()

<h2>Rename Columns title</h2>

In [ ]:
iris.columns

In [ ]:
iris.rename(columns = {'sepal_length' : 'sep_len', 'sepal_width' : 'sep_wid', 'petal_length' : 'pet_len', 'petal_width' : 'pet_wid', 'class' : 'name'}, inplace=True)
# note: command of 'inplace = True' causes the changes to be applied directly to the dataset

In [ ]:
iris

<h2>Insert a new column in the dataset</h2>

In [ ]:
iris.insert(2, 'color', 'blue')     # insert(index, title, value)

In [ ]:
iris

<h2>Delete a column from the dataset</h2>

In [ ]:
iris.drop('color', axis = 1, inplace = True)     # 'axis = 1' : vertical column

In [ ]:
iris

<h2>Delete a row from the dataset</h2>

In [ ]:
iris.drop(1, inplace = True)     # drop(index of row) ==> default axis = 0 : horizontal row

In [ ]:
iris

<h2>Join 2 or more dataset together with 'Concat' (vertical/horizontal)</h2>

In [ ]:
iris_conc = pd.concat([iris, iris], axis = 1)

In [ ]:
iris_conc

<h2>Add a row to the dataset with 'Concat'</h2>

In [ ]:
row = {'sep_len' : 10, 'sep_wid' : 20, 'pet_len' : 30, 'pet_wid' : 40, 'name' : 'Nilufar'}
iris_row = pd.DataFrame(row, index = [0])
iris = pd.concat([iris, iris_row])     # default axis = 0 (horizontal)
iris

In [ ]:
iris.reset_index(inplace = True)     # reset indexes of dataset
iris

In [ ]:
iris.drop(['level_0', 'index'], axis = 1, inplace = True)
iris

<h2>Delete duplicate rows in the dataset</h2>

In [ ]:
iris = pd.concat([iris, iris_row])
iris.reset_index(inplace = True)
iris

In [ ]:
iris.drop(['index'], axis = 1, inplace = True)

In [ ]:
iris

In [ ]:
iris[iris.name == 'Nilufar'].value_counts()

In [ ]:
iris.drop_duplicates(inplace = True)
iris

In [ ]:
iris[(iris['name'] == 'Nilufar')].value_counts()

In [ ]:
iris.shape

In [ ]:
iris.drop_duplicates(subset=['sep_len'], inplace = True)     # delete rows that some columns are duplicate
iris.shape

In [ ]:
iris

In [ ]:
iris.drop(iris.index[:10], inplace = True)     # delete slice of rows
iris

In [ ]:
iris.shape

<h2>Find Null/NaN values is dataset</h2>

In [ ]:
tita.isna()     # output = boolean

In [ ]:
tita.isna().sum()     # Count of Null/NaN values in each column

In [ ]:
# Note : When use from 'drop_duplicate'?
# If duplicate data has a negative effect on the results of data analysis 
# or
# where there is no need for duplicate data and a lot of time is spent on checking them.
# Result: Business Understanding is very importand in preprocessing of data

<h2>Delete Null/NaN rows</h2>

In [ ]:
tita.shape

In [ ]:
tita.dropna(inplace = True)     # Delete all rows that have null/nan value in columns
tita.shape

<h2>Change position of rows and columns</h2>

In [ ]:
iris = iris.transpose()
iris

<h2>Apply function</h2>
<h7>We use from 'apply' function when we want to do something on a column</h7>
<h2>Lambda function</h2>
<h7>A lambda function is a small anonymous function.</h7>

<h7>A lambda function can take any number of arguments, but can only have one expression.</h7>

In [ ]:
iris = iris.transpose()
iris

In [ ]:
iris.sep_len = iris.sep_len.apply(lambda x : x * 100)
iris.sep_len

<h2>Copy from dataset</h2>

In [ ]:
iris_1 = iris.copy()     # id(iris_1) != id(iris)
print("id(iris_1):", id(iris_1))
print('id(iris):', id(iris))

<h2>Change Type of values of a column</h2>

In [ ]:
iris.info()

In [ ]:
iris.sep_len = iris.sep_len.astype(int)

In [ ]:
iris.info()

In [ ]:
# note:
# What is 'object' type?
# In Python, the term “object” is quite the catch-all; including numbers, strings of characters, lists, functions
# A Python object is essentially anything that you can assign to a variable.

In [ ]:
iris.index   # index of all rows

In [ ]:
iris

In [ ]:
iris.sep_len.idxmax()     # index of max value of a column

In [ ]:
iris.sep_len.idxmin()     # index of min value of a column

In [ ]:
iris[iris['sep_len'].index == (iris.sep_len.idxmin())]['sep_len']

In [ ]:
iris[iris['sep_len'].index == (iris.sep_len.idxmax())]['sep_len']

In [ ]:
tita.dtypes     # Types of values of all columns

<h2>Replace function</h2>

In [ ]:
iris[iris.name == 'Iris-setosa']

In [ ]:
iris.name.replace('Iris-setosa', 'Setosa', inplace = True)
iris[iris.name == 'Iris-setosa']

In [ ]:
iris[iris.name == 'Setosa']

In [ ]:
tita = pd.read_excel('titanic3.xlsx')
tita

<h2>GroupBy</h2>

In [ ]:
tita.groupby('sex').count()

In [ ]:
tita.groupby(['survived', 'sex']).count()

In [ ]:
tita.groupby('sex').first()     # First row in group

In [ ]:
tita.groupby('sex').last()      # Last row in group

<h2>Aggregation and Grouping</h2>

In [ ]:
tita.groupby(['sex', 'survived']).agg({'age' : ['max', 'min', 'sum', 'mean']})

<h2>Pivot_table function</h2>

In [ ]:
tita.pivot_table(index = 'name', columns = ['sex'], values = 'pclass')

In [ ]:
tita.pivot_table(index = ['sex', 'survived', 'pclass'], values = 'age', aggfunc = {'max', 'min', 'sum', 'mean'})

<h2>Fillna function</h2>
<h7>Fill Null/NaN cells</h7>

In [ ]:
tita.isna().sum()

In [ ]:
tita.fillna({'age' : round(tita1.age.mean())}, inplace = True)     # Fill Null/NaN cells from a column with value = 30
# Also you can use from 'bfill(back fill)' and 'ffill(forward fill)'
tita.age

In [ ]:
tita.age.isna().sum()

<h2>Time Series</h2>

In [ ]:
idx=pd.date_range("2018-01-01 00-00-00", periods=20, freq=pd.offsets.Minute(3))
value=np.random.rand(20)
pd.DataFrame(value,index=idx)

<h2>Map function</h2>
<h7>Map in Python is a function that works as an iterator to return a result after applying a function to every item of an iterable (tuple, lists, etc.)</h7>

In [ ]:
def powertwo(number):
    return number * number
    
list_nums = [1, 2, 3, 4, 5]
print(list(map(powertwo, list_nums)))

In [ ]:
pd.__version__     # version of a library